Revit 2024 API
IFCRange Constructor (IFCRange)
 Instantiates an IFCRange object by copy.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public IFCRange(
	IFCRange from
)
Visual Basic
Public Sub New ( _
	from As IFCRange _
)
Visual C++
public:
IFCRange(
	IFCRange^ from
)
Parameters
from
Type: Autodesk.Revit.DB.IFC.IFCRange
 The IFCRange object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCRange Class
IFCRange Overload
Autodesk.Revit.DB.IFC Namespace